Интенсивное_обучение_программированию/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <comment>Документ заказа номенклатуры</comment>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокРасходников</name>
    <attributes>
      <name>Расходник</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокМатериалов

&НаКлиенте
Процедура СписокМатериаловЦенаПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловКоличествоПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокМатериалов();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРасходников

&НаКлиенте
Процедура СписокРасходниковЦенаПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокРасходников();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРасходниковКоличествоПриИзменении(Элемент)
	
	РасчетСтрокиТоваровСписокРасходников();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчетСтрокиТоваровСписокМатериалов()
	
	СтрокаРасчета 		= Элементы.СписокМатериалов.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСтрокиТоваровСписокРасходников()
	
	СтрокаРасчета 		= Элементы.СписокРасходников.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	
КонецПроцедуры

#КонецОбласти
